// Переменные ! 
// 1.
// var city = `Chelyabinsk`;
// console.log(city);
// city = `Moscow`;
// console.log(city);
//  ====================

// 2.
// const BlueColor = `blue`;
//  ====================

// 3.
// var sneakerBoxColor = `green`;
// var SneakerBoxColor = `red`;
// var sneaker_box_color = `blue`;
//  ====================

// 4.
// var sneakerBoxColor = `blue`;
// var SneakerBoxColor = `red`;
// console.log(sneakerBoxColor,SneakerBoxColor);
//  ====================

// 5.
// let Name,Age,Color;
// Name = `Vitya`;
// Age = 25;
// Color = `red`;
// console.log(Name,Age,Color);
//  ====================

// 6.
// var SomeFloatNum = 16.4;
// console.log(SomeFloatNum);
//  ====================


//  Типы данных! 
// 1.
// var age = `25`;
//  ====================

// 2.
// var myAge = 25;
//  ====================

// 3.
// boolean = тип данных, на который ответ может быть yes/no; true/false; 
//  ====================

// 4.
// let undefined;
//  ====================

// 5.
// let car = {
//     age: 25,
//     color: `blue`,
//     brand: `Opel`,
// }
// console.log(car.age);
// car.color = `red`;
// console.log(car);
//  ====================

// 6.
// let myObject = [true, `blue`, `red`, 25, 43];
// console.log(myObject[1], myObject[3]);
// myObject[0] = maksim;
// myObject[3] = oleg;
//  ====================

// 7.
// var age = 25
// var name = `dmitrii`
// console.log (age - name);
//  ====================

// 8.
// let ThisIsMyObject = {
//     name: `Dima`
// }
// var Peremennaya = ThisIsMyObject.name;
// console.log(typeof Peremennaya, Peremennaya);
//  ====================

// 9.
// существует 8 типов данных
//  ====================

// 10.
// поумолчанию в переменных, которым еще не присвоено значение используется undefined.
// null - это отдельный тип данных, который говорит, что здесь ничего нет (пусто). 
//  ====================

// 11.
// Строки в JS можно заключать хоть в одинарные, хоть в двойные кавычки. Для JS в них нет разницы. 
//  ====================

// 12.
// Индекс - это порядковый номер массива. Порядковый номер всегда начинается с 0. Значение массива - это переменные, которые мы храним внутри него.
//  ====================

// 13.
// NaN
//  ====================

// 14.
// в таком случае оператор typeof присвоит объекту тип данных Object. 
//  ====================

// 15.
// Взаимодействие с пользователем!
// answerQuestion = confirm(`Вы поддерживаете партию зелёных человечков?`);
// console.log(answerQuestion);
//  ====================

// 16.
// howOldAreYou = +prompt(`Сколько тебе лет?`);
// console.log(typeof howOldAreYou);
//  ====================

// 17.
// Не смог сделать.
//  ====================

// 18.
// + перед prompt ставим для того, чтобы тип возвращаемого значения был Number;
//  ====================

// Операторы и приведение типов!
// 1.
// console.log (2 ** 2);
//  ====================

// 2.
// var privet = `Привет `;
// var mir = `Мир!`;
// var privetMir = privet + mir;
// console.log(privetMir);
//  ====================

// 3.
//  ====================

// 4.
//  ====================

// 5.
//  ====================

// 6.
//  ====================

// 7.
//  ====================

// 8.
//  ====================

// 9.
//  ====================

// 10.
//  ====================

// 11.
//  ====================

// 12.
//  ====================

// 13.
//  ====================

