// 1.
// let a = 1;
// while (a <= 32) {
//     a++
//     console.log(a);
// }
// =============

// 2.
// let a = 59;
// for (; a >= 0; a--) {
//     console.log(a);
// }
// =============

// 3.
// let a = 0;
// while ( a <= 200 ) {
//     a++;
//     if (a % 2 !== 0) {
//         continue;
//     }
//     console.log(a);
// }
// =============

// 4.
// let arr = [];
// for (let i = 0; i <=19; i++) {
//     arr[i];
// }
// console.log(arr);
// =============

// 5.
// const arr = [ "Анастасия", "Алексей", "Аркадий", "Эманнуил", "Сергей", "Семён",
// "Светлана", "Олег", ];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] === 'Анастасия') console.log(arr[i]);
//     break;
// }
// =============

// 6.
// const arr = [ "Анастасия", "Алексей", "Аркадий", "Эманнуил", "Сергей", "Семён",
// "Светлана", "Олег", ];
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] !== 'Сергей') console.log(arr[i]);
// }
// =============

// 7.
// let sum = 0;
// console.log(sum)
// for (let i = 0; i < arr.length; i++) {
//     sum += arr[i]
// }
// console.log(sum);
// =============

// 8.
// let number = +prompt('Укажите номер дня недели', 'Введите число');
// let daysOfWeek = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье'];
// for (let i = 0; i < daysOfWeek.length && i < number; i++) {
//     console.log(`День ${i + 1}, день недели ${daysOfWeek[i]}`)
// }
// =============

// 9.
// Несправился
// =============

// 10.
// let arr = [ "Анастасия", "Алексей", "Аркадий", "Эманнуил", "Сергей", "Семён", "Светлана", "Олег", ];
// for (let i = 0; i < arr.length; i++) {
//     console.log(`Значение элемента ${arr[i]}, начинается с ${arr[i][0]}`)
// }